###################################################################

# Created by write_sdc on Wed Dec 30 12:05:56 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports MemRead]
set_load -pin_load 3.40189 [get_ports MemWrite]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[31]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[30]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[29]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[28]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[27]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[26]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[25]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[24]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[23]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[22]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[21]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[20]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[19]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[18]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[17]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[16]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[15]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[14]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[13]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[12]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[11]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[10]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[9]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[8]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[7]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[6]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[5]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[4]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[3]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[2]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[1]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_address[0]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[31]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[30]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[29]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[28]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[27]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[26]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[25]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[24]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[23]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[22]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[21]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[20]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[19]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[18]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[17]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[16]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[15]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[14]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[13]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[12]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[11]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[10]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[9]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[8]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[7]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[6]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[5]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[4]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[3]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[2]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[1]}]
set_load -pin_load 3.40189 [get_ports {Data_memory_write_data[0]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[31]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[30]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[29]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[28]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[27]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[26]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[25]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[24]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[23]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[22]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[21]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[20]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[19]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[18]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[17]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[16]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[15]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[14]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[13]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[12]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[11]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[10]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[9]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[8]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[7]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[6]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[5]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[4]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[3]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[2]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[1]}]
set_load -pin_load 3.40189 [get_ports {Instruction_memory_input[0]}]
create_clock [get_ports clk]  -name MY_CLK  -period 2.6  -waveform {0 1.3}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports en]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_output[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_output[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemRead]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemWrite]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_address[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_memory_write_data[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction_memory_input[0]}]
