analyze -f vhdl -lib WORK ../fpuvhdl/common/fpnormalize_fpnormalize.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/common/fpround_fpround.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/common/packfp_packfp.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/common/unpackfp_unpackfp.vhd

analyze -f vhdl -lib WORK ../fpuvhdl/multiplier/MBE/BEU.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/multiplier/MBE/half_adder.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/multiplier/MBE/full_adder.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/multiplier/MBE/MBE.vhd

analyze -f vhdl -lib WORK ../fpuvhdl/multiplier/my_register.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/multiplier/fpmul_stage1_struct.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/multiplier/fpmul_stage2_struct_MBE_triple_pipe.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/multiplier/fpmul_stage3_struct.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/multiplier/fpmul_stage4_struct.vhd
analyze -f vhdl -lib WORK ../fpuvhdl/multiplier/fpmul_pipeline_reg_input.vhd

set power_preserve_rtl_hier_names true
ungroup -all -flatten
elaborate FPMUL -architecture PIPELINE -library work
link
create_clock -name MY_CLK -period 1.56 clk
set_dont_touch_network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] clk]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]

set_optimize_registers [get_designs FPmul]
compile_ultra -retime

report_timing > mbe_report_timing_1_56ns.txt
report_area > mbe_report_area_1_56ns.txt
report_resources > mbe_report_resources_1_56ns.txt




