###################################################################

# Created by write_sdc on Mon Nov 16 11:07:01 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports VOUT]
set_load -pin_load 3.40189 [get_ports {DOUT[7]}]
set_load -pin_load 3.40189 [get_ports {DOUT[6]}]
set_load -pin_load 3.40189 [get_ports {DOUT[5]}]
set_load -pin_load 3.40189 [get_ports {DOUT[4]}]
set_load -pin_load 3.40189 [get_ports {DOUT[3]}]
set_load -pin_load 3.40189 [get_ports {DOUT[2]}]
set_load -pin_load 3.40189 [get_ports {DOUT[1]}]
set_load -pin_load 3.40189 [get_ports {DOUT[0]}]
create_clock [get_ports CLK]  -name MY_CLK  -period 6.44  -waveform {0 3.22}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports VIN]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RST_n]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {an1[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {an1[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {an1[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {an1[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {an1[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {an1[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {an1[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {an1[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {b0[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {b0[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {b0[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {b0[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {b0[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {b0[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {b0[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {b0[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn1[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn1[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn1[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn1[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn1[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn1[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn1[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn1[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn2[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn2[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn2[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn2[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn2[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn2[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn2[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {bn2[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DIN[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports VOUT]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DOUT[0]}]
